; domain
(define (domain GROCERY)
	(:requirements :strips :typing)
	(:types item)
	(:predicates (on ?x - item ?y - item)
		(ontable ?x - item)
		(cleartop ?x - item)
		(handempty)
		(holding ?x - item)
		(clearleft ?x - item)
		(clearright ?x - item)
		(toleft ?x - item ?y - item)
		(toright ?x - item ?y - item)
		(onsomething ?x - item)
		(onclutterortable ?x - item)
		)
		
	(:action pick-up
	        :parameters (?x - item)
	        :precondition (and (cleartop ?x) (handempty) (onclutterortable ?x))
	        :effect
	        (and (not (ontable ?x))
	            (not (handempty))
	            (not (cleartop ?x))
	            (holding ?x)
	            (clearleft ?x)
	            (clearright ?x)
	            (not (onclutterortable ?x))
	            (not (onsomething ?x))))
	            
	(:action put-on-table
	    :parameters (?x - item)
	    :precondition (holding ?x)
	    :effect
	    (and (not (holding ?x))
	    (cleartop ?x)
	    (handempty)
	    (ontable ?x)
	    (onclutterortable ?x)
	    (onsomething ?x)))


	(:action drop-in-clutter
		:parameters (?x - item)
		:precondition (holding ?x)
		:effect
		(and (not (holding ?x))
		(cleartop ?x)
		(clearleft ?x)
		(clearright ?x)
		(onclutterortable ?x)
		(not (onsomething ?x))
		(handempty)))
		
    
    (:action pick-up-from-on
		:parameters (?x - item ?y - item)
		:precondition (and (on ?x ?y) (onsomething ?x) (cleartop ?x) (handempty))
		:effect
		(and
	            (not (handempty))
	            (not (cleartop ?x))
	            (holding ?x)
	            (not (on ?x ?y))
	            (cleartop ?y)
	            (clearleft ?x)
	            (clearright ?x)
	            (not (onsomething ?x))))
	    
	
	(:action put-on 
	        :parameters (?x - item ?y - item)
	        :precondition (and (holding ?x) (cleartop ?y) (onsomething ?y))
	        :effect
	        (and (not (holding ?x))
	        (not (cleartop ?y))
	        (cleartop ?x)
	        (handempty)
	        (onsomething ?x)
	        (on ?x ?y)))
	        
	        
	(:action put-left
	        :parameters (?x - item ?y - item)
	        :precondition (and (holding ?x) (clearleft ?y) (ontable ?y))
	        :effect
	        (and (not (holding ?x))
	        (not (clearleft ?y))
	        (clearleft ?x)
	        (handempty)
	        (onsomething ?x)
	        (toleft ?x ?y)))
	
	(:action put-right
	        :parameters (?x - item ?y - item)
	        :precondition (and (holding ?x) (clearright ?y) (ontable ?y))
	        :effect
	        (and (not (holding ?x))
	        (not (clearright ?y))
	        (clearright ?x)
	        (handempty)
	        (onsomething ?x)
	        (toright ?x ?y)))
	        
)

; problem
(define (problem PACKED-GROCERY) 
 (:domain GROCERY)                             
 (:objects bleach nutella coke pepsi lipton - item) 

(:init  (toleft lipton pepsi) (clearright pepsi) (cleartop pepsi) (onclutterortable pepsi) (clearleft nutella) (toright lipton nutella) (cleartop nutella) (onclutterortable nutella) (clearleft coke) (clearright coke) (cleartop coke) (onclutterortable coke) (toleft nutella lipton) (toright pepsi lipton) (cleartop lipton) (onclutterortable lipton) (clearleft bleach) (clearright bleach) (cleartop bleach) (onclutterortable bleach) (handempty) )

(:goal (and (on pepsi bleach) (on lipton pepsi) (toleft coke bleach) (toright nutella bleach))))

; plan
1. (pick-up bleach)
   deleted: (handempty) (cleartop bleach) (onclutterortable bleach)
   added: (holding bleach)
   goals met: 0 of 4
2. (put-on-table bleach)
   deleted: (holding bleach)
   added: (cleartop bleach) (handempty) (ontable bleach) (onclutterortable bleach) (onsomething bleach)
   goals met: 0 of 4
3. (pick-up coke)
   deleted: (handempty) (cleartop coke) (onclutterortable coke)
   added: (holding coke)
   goals met: 0 of 4
4. (put-left coke bleach)
   deleted: (holding coke) (clearleft bleach)
   added: (handempty) (onsomething coke) (toleft coke bleach)
   goals met: 1 of 4
5. (pick-up nutella)
   deleted: (handempty) (cleartop nutella) (onclutterortable nutella)
   added: (holding nutella) (clearright nutella)
   goals met: 1 of 4
6. (put-right nutella bleach)
   deleted: (holding nutella) (clearright bleach)
   added: (handempty) (onsomething nutella) (toright nutella bleach)
   goals met: 2 of 4
7. (pick-up pepsi)
   deleted: (handempty) (cleartop pepsi) (onclutterortable pepsi)
   added: (holding pepsi) (clearleft pepsi)
   goals met: 2 of 4
8. (put-on pepsi bleach)
   deleted: (holding pepsi) (cleartop bleach)
   added: (cleartop pepsi) (handempty) (onsomething pepsi) (on pepsi bleach)
   goals met: 3 of 4
9. (pick-up lipton)
   deleted: (handempty) (cleartop lipton) (onclutterortable lipton)
   added: (holding lipton) (clearleft lipton) (clearright lipton)
   goals met: 3 of 4
10. (put-on lipton pepsi)
   deleted: (holding lipton) (cleartop pepsi)
   added: (cleartop lipton) (handempty) (onsomething lipton) (on lipton pepsi)
   goals met: 4 of 4
